#+TITLE: Devel Print Dataset Appliance Info

* Boilerplate
** Imports
#+NAME: setup
#+BEGIN_SRC jupyter-python :session main :kernel nilmtk-env :async yes :noweb yes
from nilmtk.api import API
import warnings
from nilmtk.disaggregate import CO
from nilmtk.disaggregate import FHMMExact
from nilmtk import DataSet
warnings.filterwarnings("ignore")
dataDir = '/home/benjaminf/data/'
#+End_src

** Import Redd
#+BEGIN_SRC jupyter-python :session main :kernel nilmtk-env :async yes :noweb yes
<<setup>>
redd = DataSet(dataDir+'/redd/redd.h5')
#+End_src

#+RESULTS:
** Import uk-dale

#+BEGIN_SRC jupyter-python :session main :kernel nilmtk-env :async yes :noweb yes
<<setup>>
ukdale = DataSet(dataDir+'/ukdale/ukdale.h5')
#+End_src

#+RESULTS:
* Experiment
#+BEGIN_SRC jupyter-python :session main :kernel nilmtk-env :async yes :noweb yes
import sys, os

# Disable
def blockPrint():
    sys.stdout = open(os.devnull, 'w')

# Restore
def enablePrint():
    sys.stdout = sys.__stdout__
build=5
blockPrint()
listAvailACTypes = []
nActive =0
nReactive=0
nApparent=0
for iii in range(len(ukdale.buildings[build].elec.meters)):
    if not ukdale.buildings[build].elec.meters[iii].is_site_meter():
        theseACtypes = ukdale.buildings[build].elec.meters[iii].available_ac_types('power')
        nActive += theseACtypes.count('active')
        nReactive += theseACtypes.count('reactive')
        nApparent += theseACtypes.count('apparent')
        # listAvailACTypes.append(theseACtypes)
enablePrint()
# listAvailACTypes
display(f'Active:{nActive},Apparent:{nApparent},Reactive:{nReactive}')

# list(set.intersection(*listAvailACTypes))
#+End_src

#+RESULTS:
: Active:24,Apparent:0,Reactive:0

#+BEGIN_SRC jupyter-python :session main :kernel nilmtk-env :async yes :noweb yes
ukdale.buildings[1].elec.meters[3].available_ac_types('power')
# theseACtypes = redd.buildings[1].elec[1].available_ac_types('power')
#+End_src

#+RESULTS:
| active |



* ⚙ Configuration :ignore:
#+STARTUP: latexpreview
#+STARTUP:  overview
#+INCLUDE: "~/.doom.d/orgReportHeader.org"
#+OPTIONS: H:3 creator:t d:nil tags:nil email:t toc:t broken-links:t ^:nil #\n:t

# Local Variables:
# line-spacing: 0.2
# End:
